#include<reg52.h>

#define uchar unsigned char;
#define uint unsigned int;

void init() {
	// 0010    0000
	// 定时器1 定时器2
	// GATE = 0 定时器启动与停止仅受 TCON 寄存器中 TRX (X=0,1) 来控制
	// C/T = 0 为定时器模式
	// M1, M0 8 位初值自动重装的 8 位定时器
	TMOD = 0x20;

	// 定时器 1 初值
	// 控制串行口波特率
	TH1 = 0xfd;
	TL1 = 0xfd;

	// 定时器 0 初值
	// 装初值 11.0592M 晶振定时 50ms 数为 45872
	TH0 = 0x4c; // (65536 - 45872) / 256
	TL0 = 0; // (65536 - 45872) % 256

	// TCON 寄存器
	// 定时器 1 运行控制位
	TR1 = 1;

	// TR0 = 1;


	// SCON 串行口控制寄存器
	// 允许串行接收位
	// REN = 1 允许串行口接收数据
	REN = 1;

	// 10 位异步收发（8位数据），波特率可变（由定时器 1 的溢出率控制）
	SM0 = 0;
	SM1 = 1;


	// IE 中断允许寄存器
	// 全局中断允许位
	EA = 1;

	// 串行口中断允许位
	ES = 1;

	// 定时器 0 中断允许位
	ET0 = 1;
}

void main() {
	init();
	
	for (;;) {
		
	}
}

// 串口中断
void serial() interrupt 4 {
	// SCON 串行口控制寄存器
	// 接收中断标志位
	// 在中断服务中将其清 0，取消此中断申请
	RI = 0;
}

// 定时器 0 中断
void timer() interrupt 1 {
	TH0 = 0x4c; // (65536 - 45872) / 256
	TL0 = 0; // (65536 - 45872) % 256
}